---
kind: enumMember
id: F:Autodesk.Revit.DB.ScheduleFilterType.Contains
enum: Autodesk.Revit.DB.ScheduleFilterType
source: html/9b696f55-de40-8739-8cfb-decd51995cff.htm
---
# Autodesk.Revit.DB.ScheduleFilterType.Contains

For a string field, the field value contains the specified string.